-- phpMyAdmin SQL Dump
-- version 4.8.3
-- https://www.phpmyadmin.net/
--
-- Host: localhost
-- Generation Time: 
-- サーバのバージョン： 10.1.38-MariaDB
-- PHP Version: 7.3.3

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `membersapp`
--

-- --------------------------------------------------------

--
-- テーブルの構造 `dat_otoiawase`
--

CREATE TABLE `dat_otoiawase` (
  `code` int(11) NOT NULL,
  `family_name_kanji` varchar(30) NOT NULL,
  `given_name_kanji` varchar(30) NOT NULL,
  `family_name_furi` varchar(30) NOT NULL,
  `given_name_furi` varchar(30) NOT NULL,
  `phone` varchar(30) NOT NULL,
  `mail` varchar(30) NOT NULL,
  `otoiawase` text NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `updated_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `note` varchar(30) NOT NULL DEFAULT '一時保存中'
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- テーブルのデータのダンプ `dat_otoiawase`
--

INSERT INTO `dat_otoiawase` (`code`, `family_name_kanji`, `given_name_kanji`, `family_name_furi`, `given_name_furi`, `phone`, `mail`, `otoiawase`, `created_at`, `updated_at`, `note`) VALUES
(1, '野原', '達夫', '', '', '09036123226', 'tnohara48@gmail.com', '', '2018-10-26 02:31:38', '2018-10-26 02:31:38', '一時保存中'),
(2, '野原', '達夫', '', '', '9036123226', 'tnohara48@gmail.com', '123', '2018-10-29 06:44:45', '2018-10-29 06:44:45', '一時保存中'),
(3, '野原', '達夫', '', '', '9036123226', 'tnohara48@gmail.com', '123', '2018-10-29 06:45:18', '2018-10-29 06:45:18', '一時保存中'),
(4, '野原', '達夫', '', '', '9036123226', 'tnohara48@gmail.com', 'ｑｗでｑｗｄｗ', '2018-11-01 06:44:34', '2018-11-01 06:44:34', '一時保存中'),
(5, '野原', '達夫', 'のはら', 'たつお', '9036123226', 'tnohara48@gmail.com', 'ｑｗでｑｗｄｗ', '2018-11-01 06:52:33', '2018-11-01 06:52:33', '一時保存中'),
(6, '野原', '達夫', 'のはら', 'たつお', '9036123226', 'tnohara@futtotahato.com', 'ha', '2018-11-02 03:26:27', '2018-11-02 03:26:27', '一時保存中');

-- --------------------------------------------------------

--
-- テーブルの構造 `diary_members`
--

CREATE TABLE `diary_members` (
  `code` int(11) NOT NULL,
  `member_id` int(11) NOT NULL,
  `member_name` text NOT NULL,
  `subject1` text NOT NULL,
  `subject2` text NOT NULL,
  `subject3` text NOT NULL,
  `subject4` text NOT NULL,
  `subject5` text NOT NULL,
  `subject6` text NOT NULL,
  `subject7` text NOT NULL,
  `created_at` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `updated_at` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `is_staff` varchar(30) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- テーブルのデータのダンプ `diary_members`
--

INSERT INTO `diary_members` (`code`, `member_id`, `member_name`, `subject1`, `subject2`, `subject3`, `subject4`, `subject5`, `subject6`, `subject7`, `created_at`, `updated_at`, `is_staff`) VALUES
(1, 1, '野原達夫', 'JAVA　３ステップ', '本文', '問題', 'むつかしい', 'つぎの課題が欲しい', 'テレビ', '', '2018-11-07 14:39:50', '2018-11-07 14:39:50', ''),
(2, 1, '野原達夫', '作業', '', '', '', 'つぎの課題が欲しい', '本', '', '2018-11-07 14:42:07', '2018-11-07 14:42:07', ''),
(3, 3, 'ねぎ49', 'JAVA　３ステップ', '課題４', 'クラスがむずかしい', 'ちゃんと本を読む', 'つぎの課題が欲しい', 'テレビ', '', '2018-11-16 13:48:00', '2018-11-16 13:48:00', ''),
(4, 61, '松村沙友里', 'ももも', 'questionｑｑ', 'ℚｑｑｑ', 'Webｗ', 'その他', '本', '', '2018-11-20 22:04:56', '2018-11-20 22:04:56', ''),
(5, 12, 'nahara', '３ステップ', 'あああ', 'っっz', 'ddで', 'つぎの課題が欲しい', 'テレビ', '', '2018-11-23 06:15:23', '2018-11-23 06:15:23', ''),
(6, 12, 'nahara', '３ステップ', 'っっd', '\n\nっっj', 'っっc', 'その他', 'ビデオ', '', '2018-11-23 06:16:02', '2018-11-23 06:16:02', ''),
(7, 56, '野原 達   夫', '', 'asdfsdfa', '', '', 'つぎの課題が欲しい', 'テレビ', '', '2019-04-09 02:03:16', '2019-04-09 11:11:12', ''),
(8, 0, '', 'wGE', 'wrg', 'arg', 'q32gt', 'やったことを報告したい', 'Array', '', '2019-04-09 15:36:24', '2019-04-09 15:36:24', ''),
(9, 0, '', 'ewfg', 'qefg', 'qeg', 'qge', 'やったことを報告したい', 'Array', '', '2019-04-09 15:39:21', '2019-04-09 15:39:21', ''),
(10, 0, '', 'aerg', 'wｇｆｆｈｆｊｆ', 'えｔｈ', 'aerh', 'やったことを報告したい', 'テレビ', '', '2019-04-09 15:42:27', '2019-04-09 15:42:27', ''),
(11, 57, '野原1234達夫', 'asdfga', 'aerg', 'aerh', 'aehr', 'つぎの課題が欲しい', 'テレビ', '', '2019-04-09 19:20:38', '2019-04-09 19:20:38', '');

-- --------------------------------------------------------

--
-- テーブルの構造 `qa_history`
--

CREATE TABLE `qa_history` (
  `code_qa` int(11) NOT NULL,
  `member_id_qa` varchar(30) NOT NULL,
  `member_name_qa` varchar(30) NOT NULL,
  `category` varchar(100) NOT NULL,
  `title` varchar(100) NOT NULL,
  `question` text NOT NULL,
  `answer` text NOT NULL,
  `date_time_q` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `date_time_a` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `answerer` varchar(30) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- テーブルのデータのダンプ `qa_history`
--

INSERT INTO `qa_history` (`code_qa`, `member_id_qa`, `member_name_qa`, `category`, `title`, `question`, `answer`, `date_time_q`, `date_time_a`, `answerer`) VALUES
(1, '3', 'ねぎ49', 'JAVA/JAVA試験について', 'sadasdsa', 'ｓｓｓｓ', '', '2018-11-16 14:20:50', '2018-11-16 14:20:50', '斎藤'),
(2, '61', '松村沙友里', 'WEB関連について（HTML/CSS/Javascript）', '次の章に進みたい', 'qqqq', '', '2018-11-20 21:12:38', '2018-11-20 21:12:38', '斎藤'),
(3, '61', '松村沙友里', 'WEB関連について（HTML/CSS/Javascript）', '次の章に進みたい', 'qqqq', '', '2018-11-20 21:12:57', '2018-11-20 21:12:57', '斎藤'),
(4, '61', '松村沙友里', '英語/IT英語について', 'sadasdsa', '111', '', '2018-11-20 21:22:53', '2018-11-20 21:22:53', '大橋'),
(5, '61', '松村沙友里', '英語/IT英語について', 'sadasdsa', 'qq', '', '2018-11-20 22:11:41', '2018-11-20 22:11:41', '山本'),
(6, '61', '松村沙友里', 'プログラミング全般について', '1１１１１１１１１１１１１１１１１', '１１１１１１１１１１１１１１１１１１１', '', '2018-11-20 22:12:57', '2018-11-20 22:12:57', '田中'),
(7, '61', '\"松村沙友里\"', '\"英語/IT英語について\"', '\"ええええええええええええええええええ\"', '\"ええええええええええええええええええええええ\"', '', '2018-11-21 00:13:00', '2018-11-21 00:13:00', '\"斎藤\"'),
(8, '\"61\"', '\"松村沙友里\"', '\"JAVA/JAVA試験について\"', '\"次の章に進みたい\"', '\"秋元真夏\"', '', '2018-11-21 00:16:32', '2018-11-21 00:16:32', '\"田中\"'),
(9, '\"61\"', '\"松村沙友里\"', '\"JAVA/JAVA試験について\"', '\"sd\"', '\"ｓｓｓｓ\"', '', '2018-11-21 00:23:03', '2018-11-21 00:23:03', '\"大橋\"'),
(10, '\"61\"', '\"松村沙友里\"', '\"生活全般について\"', '\"aa\"', '\"秋元真夏\"', '', '2018-11-21 00:28:03', '2018-11-21 00:28:03', '\"田中\"'),
(11, '\"61\"', '\"松村沙友里\"', '\"生活全般について\"', '\"aa\"', '\"秋元真夏\"', '', '2018-11-21 00:29:57', '2018-11-21 00:29:57', '\"田中\"'),
(12, '\"61\"', '\"松村沙友里\"', '\"生活全般について\"', '\"aa\"', '\"秋元真夏\"', '', '2018-11-21 00:32:01', '2018-11-21 00:32:01', '\"田中\"'),
(13, '\"61\"', '\"松村沙友里\"', '\"英語/IT英語について\"', '\"アクティブ\"', '\"ありがとうございます。\"', '', '2018-11-21 00:35:00', '2018-11-21 00:35:00', '\"田中\"'),
(14, '\"61\"', '\"松村沙友里\"', '\"WEB関連について（HTML/CSS/Javascript）\"', '\"ｓｄｆ\"', '\"あああああああああああああああああああああああああああああああああああｆ\"', '', '2018-11-21 00:38:01', '2018-11-21 00:38:01', '\"田中\"'),
(15, '\"61\"', '\"松村沙友里\"', '\"プログラミング全般について\"', '\"次の章に進みたい\"', '\"アクティブあ\"', '', '2018-11-21 00:41:26', '2018-11-21 00:41:26', '\"斎藤\"'),
(16, '\"61\"', '\"松村沙友里\"', '\"WEB関連について（HTML/CSS/Javascript）\"', '\"あああああああああああああああああああああああああああああああああああ\"', '\"ああああああああああああああああああああああああああああああああああああ\"', '', '2018-11-21 00:53:54', '2018-11-21 00:53:54', '\"田中\"'),
(17, '61', '\"松村沙友里\"', '\"WEB関連について（HTML/CSS/Javascript）\"', '\"ASF\"', '\"ASF\"', '', '2018-11-21 01:12:42', '2018-11-21 01:12:42', '\"大橋\"'),
(18, '61', '\"松村沙友里\"', '\"英語/IT英語について\"', '\"asd\"', '\"dddddddddddd\"', '', '2018-11-21 01:19:10', '2018-11-21 01:19:10', '\"山本\"'),
(19, '61', '\"松村沙友里\"', '\"英語/IT英語について\"', '\"wwwwwwwwwwwwww\"', '\"wwwwwwwww\"', '', '2018-11-21 01:20:14', '2018-11-21 01:20:14', '\"諏訪\"'),
(20, '61', '\"松村沙友里\"', '\"生活全般について\"', '\"wwwwwwwwww\"', '\"eeeeeeeeeeeeeeeeeeeeeee\"', '', '2018-11-21 01:21:55', '2018-11-21 01:21:55', '\"大橋\"'),
(21, '\'61\'', '\'松村沙友里\'', '\'英語/IT英語について\'', '\'dfgsh\'', '\'sdhf\'', '', '2018-11-21 01:52:57', '2018-11-21 01:52:57', '\'大橋\''),
(22, '61', '松村沙友里', 'WEB関連について（HTML/CSS/Javascript）', 'asd', 'dfffffffff', '', '2018-11-21 01:56:02', '2018-11-21 01:56:02', '大橋'),
(23, '61', '松村沙友里', 'WEB関連について（HTML/CSS/Javascript）', 'asd', 'dfffffffff', '', '2018-11-21 01:56:15', '2018-11-21 01:56:15', '大橋'),
(24, '61', '松村沙友里', 'WEB関連について（HTML/CSS/Javascript）', '55555555555555555', '555555555555555555555', '', '2018-11-21 01:58:29', '2018-11-21 01:58:29', '斎藤'),
(25, '61', '松村沙友里', 'WEB関連について（HTML/CSS/Javascript）', '66666666666666666', '66666666666666666666', '', '2018-11-21 02:04:56', '2018-11-21 02:04:56', 'その他'),
(26, '61', '松村沙友里', '「未来のかたち」について', '7777777777777777777', '7777777777777777777777', '', '2018-11-21 02:06:59', '2018-11-21 02:06:59', '諏訪'),
(27, '56', '野原 達   夫', 'プログラミングゼミについて', '', '', '', '2019-04-09 11:00:55', '2019-04-09 11:00:55', '斎藤'),
(28, '56', '野原 達   夫', 'JAVA/JAVA試験について', '', '', '', '2019-04-09 11:04:57', '2019-04-09 11:04:57', '大橋'),
(29, '57', '野原1234達夫', 'WEB関連について（HTML/CSS/Javascript）', 'aaa', 'sssss', '', '2019-04-09 20:53:07', '2019-04-09 20:53:07', '大橋');

-- --------------------------------------------------------

--
-- テーブルの構造 `users`
--

CREATE TABLE `users` (
  `id` int(11) NOT NULL,
  `name` text NOT NULL,
  `password` text NOT NULL,
  `is_staff` varchar(30) NOT NULL,
  `login_status` int(11) NOT NULL,
  `created_at` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `updated_at` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- テーブルのデータのダンプ `users`
--

INSERT INTO `users` (`id`, `name`, `password`, `is_staff`, `login_status`, `created_at`, `updated_at`) VALUES
(1, '野原達夫', '29f306744d6c7c006eeea75cf4df2583', 'スタッフ', 0, '2018-11-07 14:31:25', '2018-11-07 14:43:46'),
(2, '', '74be16979710d4c4e7c6647856088456', '一般利用者', 0, '2018-11-15 13:13:45', '2018-11-15 13:13:45'),
(3, 'ねぎ49', '1f32aa4c9a1d2ea010adcf2348166a04', '一般利用者', 0, '2018-11-15 13:13:55', '2018-11-15 13:13:55'),
(4, '白石麻衣', 'ec6a6536ca304edf844d1d248a4f08dc', '一般利用者', 0, '2018-11-20 18:11:08', '2018-11-20 18:11:08'),
(5, '白石麻衣', 'ec6a6536ca304edf844d1d248a4f08dc', '一般利用者', 0, '2018-11-20 18:11:12', '2018-11-20 18:11:12'),
(6, 'ノハラタツオ2', 'ec6a6536ca304edf844d1d248a4f08dc', '一般利用者', 0, '2018-11-20 18:13:46', '2018-11-20 18:13:46'),
(7, 'ノハラタツオ2', 'ec6a6536ca304edf844d1d248a4f08dc', '一般利用者', 0, '2018-11-20 18:13:47', '2018-11-20 18:13:47'),
(8, '白石麻衣', 'ec6a6536ca304edf844d1d248a4f08dc', '一般利用者', 0, '2018-11-21 01:08:00', '2018-11-21 01:08:00'),
(9, '白石麻衣', '1f32aa4c9a1d2ea010adcf2348166a04', '一般利用者', 0, '2018-11-21 01:08:34', '2018-11-21 01:08:34'),
(10, '白石麻衣', '1f32aa4c9a1d2ea010adcf2348166a04', '一般利用者', 0, '2018-11-21 01:08:35', '2018-11-21 01:08:35'),
(11, 'nahara', 'ec6a6536ca304edf844d1d248a4f08dc', '一般利用者', 0, '2018-11-23 06:14:04', '2018-11-23 06:14:04'),
(12, 'nahara', 'ec6a6536ca304edf844d1d248a4f08dc', '一般利用者', 0, '2018-11-23 06:14:06', '2018-11-23 06:14:06'),
(13, '野原 達夫', 'ec6a6536ca304edf844d1d248a4f08dc', '一般利用者', 0, '2019-03-29 05:27:45', '2019-03-29 05:27:45'),
(14, '野原 達夫', 'ec6a6536ca304edf844d1d248a4f08dc', '一般利用者', 0, '2019-03-29 05:27:47', '2019-03-29 05:27:47'),
(15, '野原達夫', 'ec6a6536ca304edf844d1d248a4f08dc', '一般利用者', 0, '2019-04-03 01:43:30', '2019-04-03 01:43:30'),
(16, '野原達夫', 'ec6a6536ca304edf844d1d248a4f08dc', '一般利用者', 0, '2019-04-03 01:43:32', '2019-04-03 01:43:32'),
(17, '', '74be16979710d4c4e7c6647856088456', '一般利用者', 0, '2019-04-08 11:32:33', '2019-04-08 11:32:33'),
(18, '野原 達夫', 'ec6a6536ca304edf844d1d248a4f08dc', '一般利用者', 0, '2019-04-08 11:32:44', '2019-04-08 11:32:44'),
(19, '野原 達夫', 'ec6a6536ca304edf844d1d248a4f08dc', '一般利用者', 0, '2019-04-08 11:49:49', '2019-04-08 11:49:49'),
(20, '野原 達夫', 'ec6a6536ca304edf844d1d248a4f08dc', '一般利用者', 0, '2019-04-08 12:32:40', '2019-04-08 12:32:40'),
(21, '野原 達夫', 'ec6a6536ca304edf844d1d248a4f08dc', '一般利用者', 0, '2019-04-08 14:58:10', '2019-04-08 14:58:10'),
(22, '野原 達夫', 'ec6a6536ca304edf844d1d248a4f08dc', '一般利用者', 0, '2019-04-08 15:12:05', '2019-04-08 15:12:05'),
(23, '野原 達夫', 'ec6a6536ca304edf844d1d248a4f08dc', '一般利用者', 0, '2019-04-08 19:26:11', '2019-04-08 19:26:11'),
(24, '野原 達夫', 'ec6a6536ca304edf844d1d248a4f08dc', '一般利用者', 0, '2019-04-08 19:31:34', '2019-04-08 19:31:34'),
(25, '', '74be16979710d4c4e7c6647856088456', '', 0, '2019-04-08 19:47:54', '2019-04-08 19:47:54'),
(26, '野原 達夫', 'ec6a6536ca304edf844d1d248a4f08dc', '一般利用者', 0, '2019-04-08 19:49:22', '2019-04-08 19:49:22'),
(27, '野原 達夫', 'ec6a6536ca304edf844d1d248a4f08dc', '一般利用者', 0, '2019-04-08 19:50:42', '2019-04-08 19:50:42'),
(28, '野原 達夫', 'ec6a6536ca304edf844d1d248a4f08dc', '一般利用者', 0, '2019-04-08 20:00:03', '2019-04-08 20:00:03'),
(29, '野原 達夫', 'ec6a6536ca304edf844d1d248a4f08dc', '一般利用者', 0, '2019-04-08 20:02:03', '2019-04-08 20:02:03'),
(30, '野原 達夫', 'ec6a6536ca304edf844d1d248a4f08dc', '一般利用者', 0, '2019-04-08 20:05:51', '2019-04-08 20:05:51'),
(31, '野原 達夫', 'ec6a6536ca304edf844d1d248a4f08dc', '一般利用者', 0, '2019-04-08 20:08:19', '2019-04-08 20:08:19'),
(32, '野原 達夫', 'ec6a6536ca304edf844d1d248a4f08dc', '一般利用者', 0, '2019-04-08 20:14:04', '2019-04-08 20:14:04'),
(33, '野原 達夫', 'ec6a6536ca304edf844d1d248a4f08dc', '一般利用者', 0, '2019-04-08 20:18:14', '2019-04-08 20:18:14'),
(34, '野原 達夫', 'ec6a6536ca304edf844d1d248a4f08dc', '一般利用者', 0, '2019-04-08 20:20:49', '2019-04-08 20:20:49'),
(35, '野原 達夫', 'ec6a6536ca304edf844d1d248a4f08dc', '一般利用者', 0, '2019-04-08 20:23:13', '2019-04-08 20:23:13'),
(36, '野原 達夫', 'ec6a6536ca304edf844d1d248a4f08dc', '一般利用者', 0, '2019-04-08 20:39:14', '2019-04-08 20:39:14'),
(37, '野原 達夫', 'ec6a6536ca304edf844d1d248a4f08dc', '一般利用者', 0, '2019-04-08 20:39:32', '2019-04-08 20:39:32'),
(38, '野原 達夫', '1f5542dc6ea1c62f6d35786cc684262d', '一般利用者', 0, '2019-04-08 20:42:33', '2019-04-08 20:42:33'),
(39, '野原 達夫', '1f5542dc6ea1c62f6d35786cc684262d', '一般利用者', 0, '2019-04-08 20:42:33', '2019-04-08 20:42:33'),
(40, 'ノハラタツオ', 'ceebc1c9fda3d8efb2166a48e8a3d0b3', '一般利用者', 0, '2019-04-08 20:45:53', '2019-04-08 20:45:53'),
(41, 'ゲスト', '3b18715a1e02bc64bd0236415f7f0912', '一般利用者', 0, '2019-04-08 20:47:27', '2019-04-08 20:47:27'),
(42, 'futottahato', '3b18715a1e02bc64bd0236415f7f0912', '一般利用者', 0, '2019-04-08 20:48:49', '2019-04-08 20:48:49'),
(43, 'あさあさｓ', 'ceebc1c9fda3d8efb2166a48e8a3d0b3', '一般利用者', 0, '2019-04-08 20:49:19', '2019-04-08 20:49:19'),
(44, 'ああああああああ！', '3b18715a1e02bc64bd0236415f7f0912', '一般利用者', 0, '2019-04-08 20:55:16', '2019-04-08 20:55:16'),
(45, 'ｑｑｑｑｑｑｑｑｑｑ', 'ceebc1c9fda3d8efb2166a48e8a3d0b3', '一般利用者', 0, '2019-04-08 20:57:08', '2019-04-08 20:57:08'),
(46, '', '1f5542dc6ea1c62f6d35786cc684262d', '一般利用者', 0, '2019-04-08 21:52:31', '2019-04-08 21:52:31'),
(47, '野原 達　　　夫', 'ceebc1c9fda3d8efb2166a48e8a3d0b3', '一般利用者', 0, '2019-04-08 23:04:05', '2019-04-08 23:04:05'),
(48, '野原 達　夫', 'ec6a6536ca304edf844d1d248a4f08dc', '一般利用者', 0, '2019-04-08 23:07:06', '2019-04-08 23:07:06'),
(49, 'ノハラタffffツオ', 'ceebc1c9fda3d8efb2166a48e8a3d0b3', '一般利用者', 0, '2019-04-08 23:18:52', '2019-04-08 23:18:52'),
(50, '', '74be16979710d4c4e7c6647856088456', '', 0, '2019-04-08 23:21:45', '2019-04-08 23:21:45'),
(51, '', '74be16979710d4c4e7c6647856088456', '', 0, '2019-04-08 23:22:01', '2019-04-08 23:22:01'),
(52, '野原 vbvgjh達夫', 'ceebc1c9fda3d8efb2166a48e8a3d0b3', '一般利用者', 0, '2019-04-08 23:23:30', '2019-04-08 23:23:30'),
(53, '野原 達夫', 'ec6a6536ca304edf844d1d248a4f08dc', '一般利用者', 0, '2019-04-09 01:27:56', '2019-04-09 01:27:56'),
(54, '野原 達夫', 'ec6a6536ca304edf844d1d248a4f08dc', '一般利用者', 0, '2019-04-09 01:41:36', '2019-04-09 01:41:36'),
(55, '野原 達夫', 'ec6a6536ca304edf844d1d248a4f08dc', '一般利用者', 0, '2019-04-09 01:46:22', '2019-04-09 01:46:22'),
(56, '野原 達   夫', 'ceebc1c9fda3d8efb2166a48e8a3d0b3', '一般利用者', 0, '2019-04-09 01:59:04', '2019-04-09 01:59:04'),
(57, '野原1234達夫', 'ec6a6536ca304edf844d1d248a4f08dc', 'スタッフ', 0, '2019-04-09 11:29:45', '2019-04-09 11:30:14');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `dat_otoiawase`
--
ALTER TABLE `dat_otoiawase`
  ADD PRIMARY KEY (`code`);

--
-- Indexes for table `diary_members`
--
ALTER TABLE `diary_members`
  ADD PRIMARY KEY (`code`);

--
-- Indexes for table `qa_history`
--
ALTER TABLE `qa_history`
  ADD PRIMARY KEY (`code_qa`);

--
-- Indexes for table `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `dat_otoiawase`
--
ALTER TABLE `dat_otoiawase`
  MODIFY `code` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7;

--
-- AUTO_INCREMENT for table `diary_members`
--
ALTER TABLE `diary_members`
  MODIFY `code` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=12;

--
-- AUTO_INCREMENT for table `qa_history`
--
ALTER TABLE `qa_history`
  MODIFY `code_qa` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=30;

--
-- AUTO_INCREMENT for table `users`
--
ALTER TABLE `users`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=58;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
